read_verilog memoria.v
hierarchy -check -top memoria
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog memoria_synth.v
