read_verilog mux_dest.v
hierarchy -check -top mux_dest
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog mux_dest_synth.v
