read_verilog demux_dest.v
hierarchy -check -top demux_dest
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog demux_dest_synth.v
