read_verilog maquina.v
hierarchy -check -top maquina
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog maquina_synth.v
